# MepAnalyticalElecCurrent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepAnalyticalElecCurrent Property
ParameterTypeId Class See Also
---
"Current"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepAnalyticalElecCurrent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepAnalyticalElecCurrent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepAnalyticalElecCurrent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace